===============================================================================================
Layer (type:depth-idx)                        Output Shape              Param #
===============================================================================================
├─GeometricEmbeddingNetwork_modify: 1-1       [-1, 960, 1]              --
|    └─Conv1d: 2-1                            [-1, 64, 1000]            256
|    └─BatchNorm1d: 2-2                       [-1, 64, 1000]            128
|    └─AvgPool1d: 2-3                         [-1, 64, 1]               --
|    └─Conv1d: 2-4                            [-1, 128, 1000]           8,320
|    └─BatchNorm1d: 2-5                       [-1, 128, 1000]           256
|    └─AvgPool1d: 2-6                         [-1, 128, 1]              --
|    └─Conv1d: 2-7                            [-1, 256, 1000]           33,024
|    └─BatchNorm1d: 2-8                       [-1, 256, 1000]           512
|    └─AvgPool1d: 2-9                         [-1, 256, 1]              --
|    └─Conv1d: 2-10                           [-1, 512, 1000]           131,584
|    └─BatchNorm1d: 2-11                      [-1, 512, 1000]           1,024
|    └─AvgPool1d: 2-12                        [-1, 512, 1]              --
├─GeometricEmbeddingNetwork_modify: 1-2       [-1, 960, 1]              --
|    └─Conv1d: 2-13                           [-1, 64, 1000]            256
|    └─BatchNorm1d: 2-14                      [-1, 64, 1000]            128
|    └─AvgPool1d: 2-15                        [-1, 64, 1]               --
|    └─Conv1d: 2-16                           [-1, 128, 1000]           8,320
|    └─BatchNorm1d: 2-17                      [-1, 128, 1000]           256
|    └─AvgPool1d: 2-18                        [-1, 128, 1]              --
|    └─Conv1d: 2-19                           [-1, 256, 1000]           33,024
|    └─BatchNorm1d: 2-20                      [-1, 256, 1000]           512
|    └─AvgPool1d: 2-21                        [-1, 256, 1]              --
|    └─Conv1d: 2-22                           [-1, 512, 1000]           131,584
|    └─BatchNorm1d: 2-23                      [-1, 512, 1000]           1,024
|    └─AvgPool1d: 2-24                        [-1, 512, 1]              --
├─Conv1d: 1-3                                 [-1, 512, 1]              492,032
├─BatchNorm1d: 1-4                            [-1, 512, 1]              1,024
├─Conv1d: 1-5                                 [-1, 256, 1]              131,328
├─BatchNorm1d: 1-6                            [-1, 256, 1]              512
├─Conv1d: 1-7                                 [-1, 128, 1]              32,896
├─BatchNorm1d: 1-8                            [-1, 128, 1]              256
├─Conv1d: 1-9                                 [-1, 3, 1]                387
===============================================================================================
Total params: 1,008,643
Trainable params: 1,008,643
Non-trainable params: 0
Total mult-adds (M): 345.45
===============================================================================================
Input size (MB): 0.01
Forward/backward pass size (MB): 29.31
Params size (MB): 3.85
Estimated Total Size (MB): 33.17
===============================================================================================
